#lang racket/base

(require ming
         "8gua.rkt")

(provide 六十四卦 三十二阴卦 三十二阳卦 六十四卦名符)

(名 三十二阴卦 ;阳生阴
    (􏿴 '乾 #;8 '夬     '大有   '大壮   '小畜  '需   '大畜 '泰
        '履     '兑 #;8 '睽     '归妹   '中孚  '节   '损   '临
        '同人   '革     '离 #;8 '丰     '家人  '既济 '贲   '明夷
        '无妄   '随     '噬嗑   '震 #;8 '益    '屯   '颐   '复
        ))

(名 三十二阳卦 ;阴生阳
    (􏿴 '坤 #;8 '剥     '比     '观     '豫   '晋   '萃   '否
        '谦     '艮 #;8 '蹇     '渐     '小过 '旅   '咸   '遁
        '师     '蒙     '坎 #;8 '涣     '解   '未济 '困   '讼
        '升     '蛊     '井     '巽 #;8 '恒   '鼎   '大过 '姤
        ))

(名 六十四卦
    '(
      坤 剥 比 观 豫 晋 萃 否
      谦 艮 蹇 渐 小过 旅 咸 遁
      师 蒙 坎 涣 解 未济 困 讼
      升 蛊 井 巽 恒 鼎 大过 姤
      ;;;;;;;
      复 颐 屯 益 震 噬嗑 随 无妄
      明夷 贲 既济 家人 丰 离 革 同人
      临 损 节 中孚 归妹 睽 兑 履
      泰 大畜 需 小畜 大壮 大有 夬 乾
      )
    )

; 方圆四分四层图
; https://zh.wikipedia.org/zh-cn/%E5%85%AD%E5%8D%81%E5%9B%9B%E5%8D%A6


(名 六十四卦名符
    (􏿰 '乾   '䷀
        '坤   '䷁
        '屯   '䷂
        '蒙   '䷃
        '需   '䷄
        '讼   '䷅
        '师   '䷆
        '比   '䷇
        '小畜 '䷈
        '履   '䷉
        '泰   '䷊
        '否   '䷋
        '同人 '䷌
        '大有 '䷍
        '谦   '䷎
        '豫   '䷏
        '随   '䷐
        '蛊   '䷑
        '临   '䷒
        '观   '䷓
        '噬嗑 '䷔
        '贲   '䷕
        '剥   '䷖
        '复   '䷗
        '无妄 '䷘
        '大畜 '䷙
        '颐   '䷚
        '大过 '䷛
        '坎   '䷜
        '离   '䷝
        '咸   '䷞
        '恒   '䷟
        '遁   '䷠
        '大壮 '䷡
        '晋   '䷢
        '明夷 '䷣
        '家人 '䷤
        '睽   '䷥
        '蹇   '䷦
        '解   '䷧
        '损   '䷨
        '益   '䷩
        '夬   '䷪
        '姤   '䷫
        '萃   '䷬
        '升   '䷭
        '困   '䷮
        '井   '䷯
        '革   '䷰
        '鼎   '䷱
        '震   '䷲
        '艮   '䷳
        '渐   '䷴
        '归妹 '䷵
        '丰   '䷶
        '旅   '䷷
        '巽   '䷸
        '兑   '䷹
        '涣   '䷺
        '节   '䷻
        '中孚 '䷼
        '小过 '䷽
        '既济 '䷾
        '未济 '䷿))


;; (名 上经三十卦
;;     (􏻿 '乾   '坤   '屯   '蒙   '需  '讼
;;         '师   '比   '小畜 '履   '泰  '否
;;         '同人 '大有 '谦   '豫   '随  '蛊
;;         '临   '观   '噬嗑 '贲   '剥  '复
;;         '无妄 '大畜 '颐   '大过 '坎  '离
;;         ))


;; (名 下经三十四卦
;;     (􏻿 '咸   '恒   '遁   '大壮 '晋  '明夷
;;         '家人 '睽   '蹇   '解   '损  '益
;;         '夬   '姤   '萃   '升   '困  '井
;;         '革   '鼎   '震   '艮   '渐  '归妹
;;         '丰   '旅   '巽   '兑   '涣  '节
;;         '中孚 '小过 '既济 '未济
;;         ))
