#lang at-exp racket/base

(require ming)

(provide 八卦)

(名 八卦
    (􏿴 '坤 '艮 '坎 '巽 '震 '离 '兑 '乾))

(名 八卦符号对应表
    (􏿰 '乾 '☰
        '兑 '☱
        '离 '☲
        '震 '☳
        '巽 '☴
        '坎 '☵
        '艮 '☶
        '坤 '☷
        ))

(名 八卦二进制对应表
    (􏿰 '乾 111 ;7
        '兑 110 ;6
        '离 101 ;5
        '震 100 ;4
        '巽 011 ;3
        '坎 010 ;2
        '艮 001 ;1
        '坤 000 ;0
        ))

(名 三十二阴卦 ;阳生阴
    (􏿴 '乾 ;;0;;8
        '夬
        '大有
        '大壮
        '小畜
        '需
        '大畜
        '泰
        '履 ;;0
        '兑 ;;8
        '睽
        '归妹
        '中孚
        '节
        '损
        '临 ;;;;;;;;;;
        '同人 ;;0
        '革
        '离 ;;8
        '丰
        '家人
        '既济
        '贲
        '明夷
        '无妄 ;;0
        '随
        '噬嗑
        '震 ;;8
        '益
        '屯
        '颐
        '复
        ))

(名 三十二阳卦 ;阴生阳
    (􏿴 '坤 ;;0;;8
        '剥
        '比
        '观
        '豫
        '晋
        '萃
        '否
        '谦 ;;0
        '艮;;8
        '蹇
        '渐
        '小过
        '旅
        '咸
        '遁 ;;;;;;;;;;;
        '师 ;;0
        '蒙
        '坎;;8
        '涣
        '解
        '未济
        '困
        '讼
        '升 ;;0
        '蛊
        '井
        '巽 ;;8
        '恒
        '鼎
        '大过
        '姤
        ))

(名 六十四卦符号对应表
    (􏿰 '乾   '䷀
        '坤   '䷁
        '屯   '䷂
        '蒙   '䷃
        '需   '䷄
        '讼   '䷅
        '师   '䷆
        '比   '䷇
        '小畜 '䷈
        '履   '䷉
        '泰   '䷊
        '否   '䷋
        '同人 '䷌
        '大有 '䷍
        '谦   '䷎
        '豫   '䷏
        '随   '䷐
        '蛊   '䷑
        '临   '䷒
        '观   '䷓
        '噬嗑 '䷔
        '贲   '䷕
        '剥   '䷖
        '复   '䷗
        '无妄 '䷘
        '大畜 '䷙
        '颐   '䷚
        '大过 '䷛
        '坎   '䷜
        '离   '䷝
        '咸   '䷞
        '恒   '䷟
        '遁   '䷠
        '大壮 '䷡
        '晋   '䷢
        '明夷 '䷣
        '家人 '䷤
        '睽   '䷥
        '蹇   '䷦
        '解   '䷧
        '损   '䷨
        '益   '䷩
        '夬   '䷪
        '姤   '䷫
        '萃   '䷬
        '升   '䷭
        '困   '䷮
        '井   '䷯
        '革   '䷰
        '鼎   '䷱
        '震   '䷲
        '艮   '䷳
        '渐   '䷴
        '归妹 '䷵
        '丰   '䷶
        '旅   '䷷
        '巽   '䷸
        '兑   '䷹
        '涣   '䷺
        '节   '䷻
        '中孚 '䷼
        '小过 '䷽
        '既济 '䷾
        '未济 '䷿))
