#lang at-exp racket/base


乾   兑     离   震        巽     坎   艮    坤
111  011   101   001       110    010  100   000
7     3     5    1          6     2     4     0


乾☰   兑☱   离☲  震☳     巽☴`   坎☵    艮☶   坤☷
10%
111   011   101  001     110    010    100   000
7     3     5    1       6      2      4     0


5--10

乾巽离艮 兑坎震坤
☰☴☲☶ ☱☵☳☷



(名 上经三十卦
    (􏻿 '乾   '坤   '屯   '蒙   '需  '讼
        '师   '比   '小畜 '履   '泰  '否
        '同人 '大有 '谦   '豫   '随  '蛊
        '临   '观   '噬嗑 '贲   '剥  '复
        '无妄 '大畜 '颐   '大过 '坎  '离
        ))


(名 下经三十四卦
    (􏻿 '咸   '恒   '遁   '大壮 '晋  '明夷
        '家人 '睽   '蹇   '解   '损  '益
        '夬   '姤   '萃   '升   '困  '井
        '革   '鼎   '震   '艮   '渐  '归妹
        '丰   '旅   '巽   '兑   '涣  '节
        '中孚 '小过 '既济 '未济
        ))


(名 64卦对应表
    (􏿰 '乾　 '䷀
        '坤　 '䷁
        '屯　 '䷂
        '蒙　 '䷃
        '需　 '䷄
        '讼　 '䷅
        '师　 '䷆
        '比　 '䷇
        '小畜 '䷈
        '履　 '䷉
        '泰　 '䷊
        '否　 '䷋
        '同人 '䷌
        '大有 '䷍
        '谦　 '䷎
        '豫　 '䷏
        '随　 '䷐
        '蛊　 '䷑
        '临　 '䷒
        '观　 '䷓
        '噬嗑 '䷔
        '贲　 '䷕
        '剥　 '䷖
        '复　 '䷗
        '无妄 '䷘
        '大畜 '䷙
        '颐　 '䷚
        '大过 '䷛
        '坎　 '䷜
        '离　 '䷝
        '咸　 '䷞
        '恒　 '䷟
        '遁　 '䷠
        '大壮 '䷡
        '晋　 '䷢
        '明夷 '䷣
        '家人 '䷤
        '睽　 '䷥
        '蹇　 '䷦
        '解　 '䷧
        '损　 '䷨
        '益　 '䷩
        '夬　 '䷪
        '姤　 '䷫
        '萃　 '䷬
        '升　 '䷭
        '困　 '䷮
        '井　 '䷯
        '革　 '䷰
        '鼎　 '䷱
        '震　 '䷲
        '艮　 '䷳
        '渐　 '䷴
        '归妹 '䷵
        '丰　 '䷶
        '旅　 '䷷
        '巽　 '䷸
        '兑　 '䷹
        '涣　 '䷺
        '节　 '䷻
        '中孚 '䷼
        '小过 '䷽
        '既济 '䷾
        '未济 '䷿))
