#lang at-exp racket/base

(require racket/format
         ming ming/number
         "pages/show.rkt"
         )



;; (名 沪市A股 '("600" "601" "603"))
;; (名 沪市B股 '("900"))

;; (名 深市A股 '("000"))
;; (名 深市B股 '("200"))

;; (名 科创板 '("688"))
;; (名 创业板 '("300"))
;; (名 中小板 '("002"))

;; (名 早期上市股 '("6006"))


(名 strs
    (􏿴 "sh603259" ;药明康德
        "sz300015" ;艾尔眼科
        "sh600750" ;江中药业
        "sh600559" ;老白干
        "sz000858" ;五粮液
        "sz000568" ;泸州老窖
        "sh600519" ;贵州茅台
        "sz002049" ;紫光国微
        "sz300750" ;宁德时代
        "sz002594" ;比亚迪
        "sz002709" ;天赐材料
        "sz002460" ; zf锂业
        "sh600585" ; 海螺水泥
        "sh600819" ;耀皮玻璃
        ))


(佫 gen-180d.html strs)
