#lang at-exp racket/base

(module+ test
  (require rackunit))

;; Notice
;; To install (from within the package directory):
;;   $ raco pkg install
;; To install (once uploaded to pkgs.racket-lang.org):
;;   $ raco pkg install <<name>>
;; To uninstall:
;;   $ raco pkg remove <<name>>
;; To view documentation:
;;   $ raco docs <<name>>
;;
;; For your convenience, we have included LICENSE-MIT and LICENSE-APACHE files.
;; If you would prefer to use a different license, replace those files with the
;; desired license.
;;
;; Some users like to add a `private/` directory, place auxiliary files there,
;; and require them in `main.rkt`.
;;
;; See the current version of the racket style guide here:
;; http://docs.racket-lang.org/style/index.html

(require ming
         ming/number
         gregor
         racket/format
         "api.rkt"
         "api-helper.rkt"
         "add-8gua.rkt"
         "add-64gua.rkt"
         "64gua.rkt"
         "8gua.rkt"

         )

;; (股号 "sh603259") ; 药明康德
;; sh601006 五粮液

;; (名 H (甲 文))
;; (攸以量卦 H 顶量 底量)

;; 令令今

(股号 "sh603259")
(名 文 (取天文/半年))
(名 顶价 (彐顶价 文))
(名 底价 (彐底价 文))
(名 顶量 (彐顶量 文))
(名 底量 (彐底量 文))

(名 卦文
    (佫 (λ (H) (攸以卦 (攸以量卦 (攸以价卦 H 顶价 底价)
                                 顶量 底量)))
        文))

(名 xvalues
    (佫 (λ (e) (􏿰弔 e 'day)) 卦文))

(名 yvalues
    (佫 (λ (e)
          (令 ([N (- (弓 六十四卦 (􏿰弔 e 'gua)) 32)])
              (若 (􏺡? N) (􏽊 N) N))
          )
        卦文)
    )

(名 ttvalues
    (佫 (λ (e) (~a (􏹔 (􏿰弔 e 'avg-price) 2)
                   "/"
                   (􏹓 (/ (句化米 (􏿰弔 e 'volume)) 10000)))
          )
        卦文)
    )



;; (佫 (λ (e) (􏿰弔 e 'gua)) 八卦文)
(佫 (λ (e) (- (弓 六十四卦 (􏿰弔 e 'gua)) 32)) 八卦文)


(佫 (λ (e) (~a (􏿰弔 e 'day) "-"
               (􏿰弔 e 'gua) "/"
               (􏹔 (􏿰弔 e 'avg-price) 2) "/"
               (􏿰弔 e 'volume))
      )
    八卦文)



(佫 (λ (e) (~a (􏹔 (􏿰弔 e 'avg-price) 2) "/"
               (􏿰弔 e 'volume))
      )
    八卦文)

(佫 (λ (e) (~a (􏿰弔 e 'day) "-"
               (􏿰弔 e 'gua) "/"
               )
      )
    八卦文)



["大畜","需","大畜","节","损","损","损","损","损","损","节","贲","贲","贲","贲","贲","贲","贲","贲","贲","既济","贲","既济","既济","贲","颐","颐","颐","屯","颐","颐","屯","巽","巽","随","震","益","屯","益","颐","颐","屯","益","益","益","屯","噬嗑","家人","既济","贲","丰","丰","既济","噬嗑","益","屯","屯","井","讼","解","涣","坎","坎","蒙","坎","蒙","艮","涣","蒙","坎","蒙","蒙","蒙","蒙","坎","坎","蒙","蒙","坎","艮","蹇","渐","渐","坎","坎","艮","蹇","蹇","小过","坎","坎","蒙","涣","巽","坎","坎","遁","蹇","艮","艮","艮","艮","艮","蹇","艮","艮","艮","艮","艮","艮","小过","坎","艮","坎","蒙","蒙","蒙","坎","坎","坎","蒙","坎","恒","鼎","井","恒","巽","巽","蛊","恒"]


[25,26,25,18,17,17,17,17,17,17,18,9,9,9,9,9,9,9,9,9,10,9,10,10,9,1,1,1,2,1,1,2,-5,-5,6,4,3,2,3,1,1,2,3,3,3,2,5,11,10,9,12,12,10,5,3,2,2,-6,-9,-12,-13,-14,-14,-15,-14,-15,-23,-13,-15,-14,-15,-15,-15,-15,-14,-14,-15,-15,-14,-23,-22,-21,-21,-14,-14,-23,-22,-22,-20,-14,-14,-15,-13,-5,-14,-14,-17,-22,-23,-23,-23,-23,-23,-22,-23,-23,-23,-23,-23,-23,-20,-14,-23,-14,-15,-15,-15,-14,-14,-14,-15,-14,-4,-3,-6,-4,-5,-5,-7,-4]

["2023-02-01","2023-02-02","2023-02-03","2023-02-06","2023-02-07","2023-02-08","2023-02-09","2023-02-10","2023-02-13","2023-02-14","2023-02-15","2023-02-16","2023-02-17","2023-02-20","2023-02-21","2023-02-22","2023-02-23","2023-02-24","2023-02-27","2023-02-28","2023-03-01","2023-03-02","2023-03-03","2023-03-06","2023-03-07","2023-03-08","2023-03-09","2023-03-10","2023-03-13","2023-03-14","2023-03-15","2023-03-16","2023-03-17","2023-03-20","2023-03-21","2023-03-22","2023-03-23","2023-03-24","2023-03-27","2023-03-28","2023-03-29","2023-03-30","2023-03-31","2023-04-03","2023-04-04","2023-04-06","2023-04-07","2023-04-10","2023-04-11","2023-04-12","2023-04-13","2023-04-14","2023-04-17","2023-04-18","2023-04-19","2023-04-20","2023-04-21","2023-04-24","2023-04-25","2023-04-26","2023-04-27","2023-04-28","2023-05-04","2023-05-05","2023-05-08","2023-05-09","2023-05-10","2023-05-11","2023-05-12","2023-05-15","2023-05-16","2023-05-17","2023-05-18","2023-05-19","2023-05-22","2023-05-23","2023-05-24","2023-05-25","2023-05-26","2023-05-29","2023-05-30","2023-05-31","2023-06-01","2023-06-02","2023-06-05","2023-06-06","2023-06-07","2023-06-08","2023-06-09","2023-06-12","2023-06-13","2023-06-14","2023-06-15","2023-06-16","2023-06-19","2023-06-20","2023-06-21","2023-06-26","2023-06-27","2023-06-28","2023-06-29","2023-06-30","2023-07-03","2023-07-04","2023-07-05","2023-07-06","2023-07-07","2023-07-10","2023-07-11","2023-07-12","2023-07-13","2023-07-14","2023-07-17","2023-07-18","2023-07-19","2023-07-20","2023-07-21","2023-07-24","2023-07-25","2023-07-26","2023-07-27","2023-07-28","2023-07-31","2023-08-01","2023-08-02","2023-08-03","2023-08-04","2023-08-07","2023-08-08","2023-08-09"]


(􏼏 1 131)


(名 沪市A股 '("600" "601" "603"))
(名 沪市B股 '("900"))

(名 深市A股 '("000"))
(名 深市B股 '("200"))

(名 科创板 '("688"))
(名 创业板 '("300"))
(名 中小板 '("002"))

(名 早期上市股 '("6006"))





(module+ test
  ;; Any code in this `test` submodule runs when this file is run using DrRacket
  ;; or with `raco test`. The code here does not run when this file is
  ;; required by another module.

  (check-equal? (+ 2 2) 4))

(module+ main
  ;; (Optional) main submodule. Put code here if you need it to be executed when
  ;; this file is run using DrRacket or the `racket` executable.  The code here
  ;; does not run when this file is required by another module. Documentation:
  ;; http://docs.racket-lang.org/guide/Module_Syntax.html#%28part._main-and-test%29

  (require racket/cmdline)
  (define who (box "world"))
  (command-line
    #:program "my-program"
    #:once-each
    [("-n" "--name") name "Who to say hello to" (set-box! who name)]
    #:args ()
    (printf "hello ~a~n" (unbox who))))
