#lang racket/base

(require ming racket/format)
(provide zixuan 自选 自选文)



(名 自选 '(("600819" . "耀皮玻璃")
           ("600750" . "江中药业")
           ("002238" . "天威视讯")
           ("600559" . "老白干酒")
           ("603259" . "药明康德")
           ("300015" . "艾尔眼科")
           ("000858" . "五粮液")
           ("002049" . "紫光国微")
           ("002709" . "天赐材料")
           ("002460" . "赣锋锂业")
           ("600585" . "海螺水泥")
           ("601398" . "工商银行")
           ("600036" . "招商银行")
           ("600111" . "北方稀土")
           ))

(名 zixuan
    (􏷑 (入 (e) (􏿴 (阳 e) (阴 e)))
       自选))

(名 自选文
    (􏷑 (入 (e) (~a (阳 e) (阴 e)))
       自选))
