#lang racket/base

(require ming ming/list racket/format)
(provide zixuan 自选 自选句 自选股号 自选股名)



(名 自选 '(("600819" . "耀皮玻璃")
           ("603259" . "药明康德")
           ("300015" . "艾尔眼科")
           ("000858" . "五粮液")
           ("002049" . "紫光国微")
           ("600585" . "海螺水泥")
           ("601398" . "工商银行")
           ("600036" . "招商银行")
           ("600111" . "北方稀土")
           ("688981" . "中芯国际")
           ))

(名 zixuan
    (􏷑 (入 (e) (􏿴 (阳 e) (阴 e)))
       自选))

(名 自选句
    (􏷑 (入 (e) (~a (阳 e) (阴 e)))
       自选))
(名 自选股号
    (􏺈 自选))
(名 自选股名
    (􏺇 自选))
